// 左1
export const l1Data = {
  type: [
    "妨害社会管理秩序罪",
    "侵犯公民人身权利、民主权利罪",
    "危害公共安全罪",
    "破坏社会主义市场经济秩序罪",
    "贪污贿赂罪",
    "侵犯财产犯罪",
  ],
  typeData: [490, 230, 210, 30, 30, 10],
};
// 左2
export const l2Data = {
  xAxis: [
    "寻衅滋事",
    "非法拘禁",
    "故意杀人",
    "偷越国境",
    "抢劫",
    "强奸",
    "聚众斗殴",
    "诈骗",
    "故意伤害",
    "盗窃",
  ],
  data: [4, 5, 5, 6, 12, 13, 15, 26, 29, 75],
};
// 右1
export const r1Data = {
  time: ["2017年", "2018年", "2019年", "2020年", "2021年"],
  people: [2003, 1504, 1201, 942, 978],
  proportion: [3.36, 2.58, 1.96, 1.71, 1.32],
};
// 右2
export const r2Data = {
  year: ["2017", "2018", "2019", "2020", "2021"],
  num: [22028, 19954, 17936, 18172, 15736],
  proportionNum: [3729, 3348, 3076, 2965, 2863],
};
// 下左1
export const bl1Data = {
  // year: ['2017', '2018', '2019', '2020'],
  dbNum: [4157, 2785, 1667, 583, 581],
  gsNum: [5926, 4590, 2914, 1341, 1062],
};
// 下左2
export const bl2Data = {
  qjNum: [665, 896, 1302, 1461, 1503],
  wxNum: [2388, 3282, 5124, 5880, 6477],
  qzwrNum: [7550, 9267, 12912, 15365, 17564],
};
// 下右
export const brData = {
  dqNum: [
    { value: 24052, name: "2017" },
    { value: 20117, name: "2018" },
    { value: 19061, name: "2019" },
    { value: 15671, name: "2020" },
    { value: 13742, name: "2021" },
  ],
};
